tiles = [
    "01猫",
    "02老鼠",
    "03公鸡",
    "04蜈蚣",
    "05梅",
    "06兰",
    "07菊",
    "08竹",
    "09春",
    "10夏",
    "11秋",
    "12冬",
    "13一筒",
    "14二筒",
    "15三筒",
    "16四筒",
    "17五筒",
    "18六筒",
    "19七筒",
    "20八筒",
    "21九筒",
    "22一索",
    "23二索",
    "24三索",
    "25四索",
    "26五索",
    "27六索",
    "28七索",
    "29八索",
    "30九索",
    "31一万",
    "32二万",
    "33三万",
    "34四万",
    "35五万",
    "36六万",
    "37七万",
    "38八万",
    "39九万",
    "40东风",
    "41南风",
    "42西风",
    "43北风",
    "44红中",
    "45青发",
    "46白板",
    "back"
    ]

for tile in tiles:
    print(f'''[data-tile="{tile}"] {{
  background-image: url("tiles/{tile}.svg");
}}

.left [data-tile="{tile}"], .right [data-tile="{tile}"] {{
  background-image: url("tiles/{tile}h.svg");
}}
''')